//
//  STACK_READY.cpp
//  2Semestr
//
//  Created by Алексей Крутов on 01/06/2019.
//  Copyright © 2019 Алексей Крутов. All rights reserved.
//

#include "STACK_READY.hpp"
#include <iostream>

using namespace std;


int main()

{
    
    stack *A=NULL;
    stack *B=NULL;
    stack *C=NULL;
    
    int choice;
    
    instructions();
    
    cout <<"? ";
    
    cin>>choice;
    
    while (choice !=21)
        
    {
        
        switch (choice)
        
        {
                
            case 1:   //Ввод нового элемента в стек
                
                A=(cin>>A);
                cout << A;
                
                break;
                /**********************************************************************************/
                
            case 2:
                
                A->pop(&A);
                cout<<A;
                break;
                
                /**********************************************************************************/
                
            case 3:      //Удаление элемента по значению
                
                if( isEmpty(A) )           //Проверка на пустоту
                {
                    cout<<"Stack is empty \n";
                }
                else                //Не пустой
                {
                    A=(*A).ZnUd();      //Вызов ZnUd, присвоение A
                    cout<<A;           //Вывод результата
                }
                
                break;
                /**********************************************************************************/
                
            case 4: // замена элемента
                A->change();
                cout<<A;
                
                
                break;
                /**********************************************************************************/
            case 5: // Инверитирование
                
                if (!isEmpty(A)) // Проверка на пустоту стэка
                    
                {
                    A->invert(&A); // Функция инвертирования
                    cout<<A; // печать получившегося стека
                }
                else
                    cout<<"STACK №1 is empty\n";
                
                
                break;
                /**********************************************************************************/
            case 6:       //Работа со стеком №2
                
                instructions1();
                
                cout<<"? ";
                cin >> choice;
                
                while (choice !=8)
                    
                {
                    
                    switch (choice)
                    
                    {
                            
                        case 1:    //Ввод нового элемента в стек
                            
                            B=(cin>>B);
                            cout << B;
                            
                            break;
                            /**********************************************************************************/
                            
                        case 2:     //Удаление элемента из стек
                            
                            B->pop(&B);
                            cout<<B;
                            break;
                            /**********************************************************************************/
                            
                        case 3: //Печать
                            
                            cout << B;
                            
                            break;
                            /**********************************************************************************/
                            
                        case 4: // замена элемента
                            A->change();
                            cout<<A;
                            
                            
                            break;
                            /**********************************************************************************/
                        case 5: // Инверитирование
                            
                            if (!isEmpty(B)) // Проверка на пустоту стэка
                                
                            {
                                B->invert(&B); // Функция инвертирования
                                cout<<B; // печать получившегося стека
                            }
                            else
                                cout<<"STACK №1 is empty\n";
                            
                            
                            
                            break;
                            /**********************************************************************************/
                        case 6:    //Длина стека
                            
                            if(isEmpty(B))
                            {
                                
                                cout<<"Stack is empty \n";
                                
                            }
                            
                            else
                                cout<<"Длина стека: " << B->dlina() << endl;
                            
                            break;
                            
                            /**********************************************************************************/
                        case 7:    //Удалениее стека
                            
                            
                            B->del(&B);
                            cout<<"stack is empty"<<endl;
                            
                            break;
                            /**********************************************************************************/
                        default:
                            
                            cout<<"Invalid choice.\n\n";
                            
                            instructions1 ();
                            
                            break;
                            
                    }
                    
                    cout<<"? ";
                    cin>>choice;
                    
                }
                
                instructions ();
                break;
                /**********************************************************************************/
                
            case 7:            //Работа со стеком №3
                
                instructions2();
                
                cout<<"? ";
                cin>>choice;
                
                while (choice !=5)
                    
                {
                    
                    switch (choice)
                    
                    {
                            
                        case 1:   //Вывод стека
                            
                            cout<<C;
                            
                            break;
                            
                            /**********************************************************************************/
                        case 2:    //Длина стека
                            
                            if(isEmpty(C))
                            {
                                
                                cout<<"Stack is empty \n";
                                
                            }
                            
                            else
                                cout<<"Длина стека: " << C->dlina() << endl;
                            
                            break;
                            
                            
                            
                            break;
                            
                            /**********************************************************************************/
                        case 3:    //Удалениее стека
                            
                            
                            C->del(&C);
                            cout<<"stack is empty"<<endl;
                            
                            break;
                            
                            /**********************************************************************************/
                            
                        case 4: ////Копирование стека в стек №1
                            
                            
                            A = C;
                            cout << A;
                            
                            break;
                            /**********************************************************************************/
                        default:
                            
                            cout<<"Invalid choice.\n\n";
                            
                            instructions2 ();
                            
                            break;
                            /**********************************************************************************/
                    }
                    
                    cout<<"? ";
                    cin>>choice;
                }
                instructions ();
                
                break;
                /**********************************************************************************/
                
            case 8:   //Сумма двух стеков
                
                if (!isEmpty(A) && !isEmpty(B) )// Проверка на пустоту стэка
                {
                    
                    C= &(*A+*B);
                    cout<<C;
                    
                }
                
                if(isEmpty(A))
                    
                    cout<<"STACK №1 is empty\n";
                
                if(isEmpty(B))
                    
                    cout<<"STACK №2 is empty\n";
                break;
                /**********************************************************************************/
            case 9:   //Слитие двух стеков
                
                
                if( isEmpty(A) && isEmpty(B) )     //Проверка на пустоту
                {
                    cout<<"Stack is empty \n";
                }
                else                         //Хотя бы один стек не пустой
                {
                    C->del(&C);                     //Очистили C
                    stack*W = B;               //Передали адресс головы
                    C= (*A) * B;             //Перегруженный *, и присвоение C
                    cout << C;             //Вывод стека
                }
                break;
                
                /**********************************************************************************/
            case 10: //Копирование стека
                
                C = A;
                cout << C;
                
                break;
                
                /**********************************************************************************/
                
            case 11:    //Длина стека
                
                if(isEmpty(A))
                {
                    
                    cout<<"Stack is empty \n";
                    
                }
                
                else
                    cout<<"Длина стека: " << A->dlina() << endl;
                
                break;
                
                
                
                /**********************************************************************************/
            case 12: //Удалениее стека
                
                A->del(&A);
                cout<<"stack is empty"<<endl;
                break;
                /**********************************************************************************/
                
            case 13: //Вставить элемент до
                
            Z_1:
                cout<< "Ведите номер элемента до которого хотите вставить: ";
                int y_2;
                cin>>y_2;
                if (y_2<=0){
                    cout<<"Вы ввели значение которого не существует, попробуйте снова: ";
                    goto Z_1;
                }
                
                cout<<"Введите значение, которое хотите записать в новый элемент стека: ";
                int z_2;
                cin>>z_2;
                
                A->pasteUp(A,y_2,z_2);
                
                break;
                
                /**********************************************************************************/
                
            case 14://Вставка после
            Z_2:
               
                int y_1;
                cout<< "Ведите номер элемента после которого хотите вставить "<<endl;
            
                cin>>y_1;
                if (y_1<=0){
                    cout<<"Вы ввели значение которого не существует, попробуйте снова: ";
                    goto Z_2;
                }
                y_1++;
                
                cout<<"Введите значение, которое хотите записать в новый элемент стека: ";
                int z_1;
                cin>>z_1;
                A->pasteDown(A,y_1,z_1);
                
                break;
                
                /**********************************************************************************/
                
            case 15:           //Удаление двойников
                
                if(!isEmpty(A))
                    
                {         // A=dv(A);
                    A->dv(&A);
                    cout<<A;
                }
                
                else
                    cout<<"STACK is empty\n";
                break;
                
                
                /**********************************************************************************/
            case 16:          //Сортировка по ключу
                
                
                
                break;
                /**********************************************************************************/
                
            case 17: //Удаление элемента по номеру
                
                int w;
                w=A->delete1();
                if(w==1)
                {
                    A->pop(&A);
                }
                cout<<A;
                
                break;
                
                /**********************************************************************************/
            case 18:       //Вывод стека
                
                cout << A;
                
                break;
                /**********************************************************************************/
            case 19: //Прибавление 1
                
                
                ++(*A);
                cout<<A;
                break;
                
                /**********************************************************************************/
                
                
            case 20:   //Разность двух стеков
                
                if (!isEmpty(A) && !isEmpty(B) )// Проверка на пустоту стэка
                {
                    
                    C= &(*A-*B);
                    cout<<C;
                    
                }
                break;
                /**********************************************************************************/
            default:
                
                cout<<"Invalid choice.\n\n";
                instructions ();
                
                break;
                /**********************************************************************************/
        }
        
        cout<<"? ";
        
        cin>>choice;
        
    }
    
    cout<<"End of run.\n";
    
    return 0;
    
}
